// chat-messages.mock.ts
export const chatMessages = [
    {
        sender: '使用者',
        message: '你好，請問怎麼選課？',
        time: '2025-04-22 14:30'
    },
    {
        sender: 'AI 助手',
        message: '你好，選課系統可於ePortal網站登入，點選「選課系統」即可開始選課。',
        time: '2025-04-22 14:31'
    },
    {
        sender: '使用者',
        message: '學校的圖書館開放時間是什麼時候？',
        time: '2025-04-22 14:32'
    },
    {
        sender: 'AI 助手',
        message: '圖書館的開放時間為週一至週五，上午8點半至晚上9點半，週六日則為上午9點至下午5點。',
        time: '2025-04-22 14:32'
    },
    {
        sender: '使用者',
        message: '圖書館怎麼借書？',
        time: '2025-04-22 14:33'
    },
    {
        sender: 'AI 助手',
        message: '進入圖書館後，用學生證感應借書機，再掃描書本條碼即可借閱。',
        time: '2025-04-22 14:33'
    },
    {
        sender: '使用者',
        message: '請問有無障礙設施嗎？',
        time: '2025-04-22 14:34'
    },
    {
        sender: 'AI 助手',
        message: '有的，校內主要建築皆設有無障礙坡道與電梯，也有專屬洗手間可供使用。',
        time: '2025-04-22 14:35'
    },
    {
        sender: '使用者',
        message: '學校有提供打工機會嗎？',
        time: '2025-04-22 14:36'
    },
    {
        sender: 'AI 助手',
        message: '有的，可以至學生事務處網站查詢「校內工讀職缺」，定期更新資訊。',
        time: '2025-04-22 14:37'
    }
];
